---
kind: method
id: M:Autodesk.Revit.DB.AssemblyMemberDifference.Dispose
source: html/5606cc2b-5833-4851-70b0-fdb983ef1844.htm
---
# Autodesk.Revit.DB.AssemblyMemberDifference.Dispose Method

Releases all resources used by the AssemblyMemberDifference

## Syntax (C#)
```csharp
public void Dispose()
```